DELETE FROM restaurant;
DELETE FROM lunch_menu;
DELETE FROM dish;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO restaurant (name) VALUES
('Джумбус'),
('Сабор де ла Вида Ресторан'),
('Lure Oyster Bar'),
('WE Cidreria'),
('Megobari');

INSERT INTO lunch_menu (date, restaurant_id) VALUES
(TODAY(),'100000'),
(TODAY(),'100001'),
(TODAY(),'100002'),
(TODAY(),'100003'),
(TODAY(),'100004'),
(DATEADD('DAY',-1,TODAY()),'100000'),
(DATEADD('DAY',-1,TODAY()),'100001'),
(DATEADD('DAY',-1,TODAY()),'100002'),
(DATEADD('DAY',-1,TODAY()),'100003'),
(DATEADD('DAY',-1,TODAY()),'100004');

INSERT INTO dish (name, price, lunch_menu_id) VALUES
('Закуска «Джумбус»',890,100005),
('Суп из ягнёнка',340,100005),
('Панированный сыр  ',380,100005),
('Ассорти брускетт',880,100006),
('Салат с ростбифом',1290,100006),
('Розовая Джоли (Намибия)',197,100007),
('Устрица с сочным манго и соусом табаско',430,100007),
('Буйабес из рыбы и морегадов',490,100007),
('Утка с малиной',150,100008),
('Клаб-сендвич с курицей и беконом',510,100008),
('Аджапсандали',450,100009),
('Салат по-мегрельски',490,100009),
('Аласка чорба',370,100010),
('Сибас «на граделе»',350,100010),
('Ассорти мясных деликатесов',980,100011),
('Салат понаш с уткой и фуа гра',1290,100011),
('Вонголе в томатном соусе',880,100011),
('Касабланка (Марокко)',210,100012),
('Руккола с авокадо и аргентинскими креветками',730,100012),
('Лосось крем-чиз',160,100013),
('Клаб-сендвич с лососем',490,100013),
('Грибной крем-суп',390,100013),
('Сациви с курицей',470,100014);

INSERT INTO user (name) VALUES
('user1'),
('user2')